socialNetwork/results/benchmark1.5b-replica-scale-09-05-26_195041/scale-8x/istio/400.txt
Running 2m test @ http://155.98.38.240:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 27.792ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 26.153ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 26.146ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 27.052ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 26.620ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 26.426ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 26.299ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 25.871ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 26.082ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 26.171ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 25.367ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 26.206ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 26.179ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 26.649ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 27.051ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 25.813ms, rate sampling interval: 59ms

-----------------------------------------------------------------------
Test Results @ http://155.98.38.240:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.16ms    5.28ms  46.78ms   83.10%
    Req/Sec    24.66     19.85    81.00     59.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   24.77ms
 75.000%   26.75ms
 90.000%   29.85ms
 99.000%   46.78ms
 99.900%   58.72ms
 99.990%   73.41ms
 99.999%   83.20ms
100.000%   83.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.087     0.000000            1         1.00
      20.159     0.100000         4409         1.11
      21.167     0.200000         8767         1.25
      22.447     0.300000        13146         1.43
      23.743     0.400000        17556         1.67
      24.767     0.500000        21908         2.00
      25.135     0.550000        24086         2.22
      25.503     0.600000        26299         2.50
      25.855     0.650000        28459         2.86
      26.271     0.700000        30695         3.33
      26.751     0.750000        32883         4.00
      27.023     0.775000        33960         4.44
      27.327     0.800000        35022         5.00
      27.759     0.825000        36151         5.71
      28.239     0.850000        37219         6.67
      28.895     0.875000        38318         8.00
      29.311     0.887500        38864         8.89
      29.855     0.900000        39407        10.00
      30.527     0.912500        39945        11.43
      31.343     0.925000        40498        13.33
      32.479     0.937500        41037        16.00
      33.247     0.943750        41312        17.78
      34.143     0.950000        41584        20.00
      35.423     0.956250        41859        22.86
      37.087     0.962500        42132        26.67
      38.879     0.968750        42405        32.00
      39.775     0.971875        42545        35.56
      40.799     0.975000        42682        40.00
      41.823     0.978125        42816        45.71
      43.007     0.981250        42955        53.33
      44.127     0.984375        43089        64.00
      44.863     0.985938        43159        71.11
      45.471     0.987500        43226        80.00
      46.303     0.989062        43295        91.43
      47.327     0.990625        43363       106.67
      48.479     0.992188        43431       128.00
      49.087     0.992969        43467       142.22
      49.631     0.993750        43501       160.00
      50.335     0.994531        43533       182.86
      50.879     0.995313        43567       213.33
      51.807     0.996094        43602       256.00
      52.191     0.996484        43619       284.44
      52.831     0.996875        43636       320.00
      53.311     0.997266        43653       365.71
      53.919     0.997656        43670       426.67
      55.551     0.998047        43687       512.00
      56.287     0.998242        43697       568.89
      57.119     0.998437        43704       640.00
      57.471     0.998633        43713       731.43
      57.951     0.998828        43721       853.33
      59.167     0.999023        43730      1024.00
      59.999     0.999121        43735      1137.78
      60.383     0.999219        43738      1280.00
      61.855     0.999316        43743      1462.86
      62.847     0.999414        43747      1706.67
      63.263     0.999512        43751      2048.00
      63.583     0.999561        43753      2275.56
      64.447     0.999609        43756      2560.00
      64.735     0.999658        43758      2925.71
      65.791     0.999707        43760      3413.33
      68.031     0.999756        43762      4096.00
      68.671     0.999780        43763      4551.11
      69.375     0.999805        43764      5120.00
      69.887     0.999829        43765      5851.43
      70.975     0.999854        43766      6826.67
      72.511     0.999878        43767      8192.00
      73.407     0.999890        43768      9102.22
      73.407     0.999902        43768     10240.00
      74.111     0.999915        43769     11702.86
      74.111     0.999927        43769     13653.33
      74.751     0.999939        43770     16384.00
      74.751     0.999945        43770     18204.44
      74.751     0.999951        43770     20480.00
      75.135     0.999957        43771     23405.71
      75.135     0.999963        43771     27306.67
      75.135     0.999969        43771     32768.00
      75.135     0.999973        43771     36408.89
      75.135     0.999976        43771     40960.00
      83.199     0.999979        43772     46811.43
      83.199     1.000000        43772          inf
#[Mean    =       25.156, StdDeviation   =        5.277]
#[Max     =       83.136, Total count    =        43772]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  47752 requests in 2.00m, 608.78MB read
  Socket errors: connect 0, read 0, write 0, timeout 18
Requests/sec:    397.90  
Transfer/sec:      5.07MB